       IDENTIFICATION DIVISION.
	PROGRAM-ID.   F-CDATE.

      * VALIDATE DATE
      * AUTHOR		DATE	REMARKS
      * VAN TZE SHAN	13/8/19	CODING

       ENVIRONMENT DIVISION.
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 WS-TABLE.
	   03 DAYS		PIC X(24) VALUE
	      '312831303130313130313031'.
           03 DAY-NO REDEFINES DAYS 	PIC 9(02) OCCURS 12.

        01 WS-DDMMYYYY.
	   03 WS-DD		PIC 9(02).
	   03 WS-MM		PIC 9(02).
	      88 VALID-MONTH	VALUE 1 THRU 12.
	   03 WS-YYYY		PIC 9(04).
	      88 LEAP-YEAR	VALUE 0.
        01 WS-YEAR		PIC 9(04). 

	LINKAGE SECTION.
	01 LINK-DDMMYYYY	PIC 9(08).
	01 LINK-ERROR-CODE	PIC 9(06).

      **********************************************************************
       PROCEDURE DIVISION USING LINK-DDMMYYYY, LINK-ERROR-CODE.
	BEGIN.

	   INITIALIZE LINK-ERROR-CODE.
	   MOVE LINK-DDMMYYYY TO WS-DDMMYYYY.
	   MOVE WS-YYYY TO WS-YEAR.

	   DIVIDE WS-YYYY BY 4 GIVING WS-YYYY REMAINDER WS-YYYY.
	   IF LEAP-YEAR MOVE 29 TO DAY-NO(02).

	   MOVE ZEROS TO LINK-ERROR-CODE.
	   IF WS-DD =0 OR (NOT VALID-MONTH) OR WS-DD > DAY-NO(WS-MM)
	      MOVE 100020 TO LINK-ERROR-CODE
	      GO TO TERMINATION.

           CALL	 '/v/cps/lib/std/f-ckyear' USING
		 WS-YEAR, LINK-ERROR-CODE.
           CANCEL '/v/cps/lib/std/f-ckyear'.

        TERMINATION.
	   EXIT PROGRAM.
	   STOP RUN.
      *End of program. 
